# Exploratory Notebook

In [1]:
import pandas as pd
import numpy as np
import scipy.stats as np
import sqlite3
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

## Reading

In [2]:
gross_revenue = pd.read_csv('../Data/bom.movie_gross.csv.gz', compression = 'gzip')

In [3]:
pd.options.display.max_columns=100

In [5]:
gross_revenue.sort_values("domestic_gross", ascending=False).head()

                             title studio  domestic_gross foreign_gross  year
1872  Star Wars: The Force Awakens     BV     936700000.0       1,131.6  2015
3080                 Black Panther     BV     700100000.0     646900000  2018
3079        Avengers: Infinity War     BV     678800000.0       1,369.5  2018
1873                Jurassic World   Uni.     652300000.0       1,019.4  2015
727          Marvel's The Avengers     BV     623400000.0     895500000  2012

In [12]:
conn = sqlite3.connect('../Data/im.db/im.db')

In [15]:
query=("""

SELECT *
FROM movie_basics

""")

movie_basics=pd.read_sql(query, conn)
movie_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [16]:
query=("""

SELECT *
FROM movie_ratings

""")

movie_ratings=pd.read_sql(query, conn)
movie_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21